app/controllers/balance_controller.rb

  def update
    @balance = current_user.user_balance
    attributes = user_balance_params.clone
    # render :text => attributes[:update_type]
    if attributes['update_type'].eql? 'add' then
      attributes[:balance] = attributes[:balance].to_d + @balance.balance
    else
      attributes[:balance] = @balance.balance - attributes[:balance].to_d
    end
    respond_to do |format|
      if @balance.update attributes.except(:update_type) then
---
UPDATE `user_balances` SET `balance` = -14.0, `updated_at` = '2015-05-02 03:59:17' WHERE `user_balances`.`id` = 1