app/controllers/books_controller.rb

  def index
    @books = Book.where(owner_email: current_user.email)
---
SELECT `books`.* FROM `books` WHERE `books`.`owner_email` = 'abcde@gmail.com'