app/controllers/books_controller.rb

INSERT INTO `books` (`title`, `author`, `isbn`, `genre`, `condition`, `price`, `comments`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `owner_email`, `due_date`, `created_at`, `updated_at`) VALUES ('Eragon', 'Christopher', '155', 'Fantasy', 'Good', 5.2, '', '61CG98i3TQL._SY344_BO1_204_203_200_.jpg', 'image/jpeg', 38609, '2015-05-12 10:56:45', 'test2@test.com', '2015-05-22', '2015-05-12 10:56:45', '2015-05-12 10:56:45')
---
  def create
    @book = Book.new(book_params, current_user.email)

    respond_to do |format|
      if @book.save

UPDATE `books` SET `image_file_name` = 'gm_wv.png', `image_content_type` = 'image/png', `image_file_size` = 54733, `image_updated_at` = '2015-05-12 01:43:48', `updated_at` = '2015-05-12 01:43:48' WHERE `books`.`id` = 3
---
  def update
    respond_to do |format|
      if @book.update(book_params)