app/controllers/transactions_controller.rb

  def index
    # @transactions = Transaction.where(buyer_email: current_user.email).or(seller_email: current_user.email)
    @transactions = Transaction.where('buyer_email=? OR seller_email= ?', current_user.email, current_user.email)
---
SELECT `transactions`.* FROM `transactions` WHERE (buyer_email='test@airbooks.com' OR seller_email= 'test@airbooks.com')

  def create
    Rails.logger.debug("CREATING TRANSACTION CHECKING")
    @transaction = Transaction.new(transaction_params)
    @book.update_attribute :checked_out, true
    respond_to do |format|
      if @transaction.save
---
INSERT INTO `transactions` (`book_id`, `buyer_email`, `seller_email`, `start_date`, `price`, `created_at`, `updated_at`) VALUES (1, 'test@airbooks.com', 'test@airbooks.com', '2015-05-11 20:19:44', 12.3, '2015-05-11 20:19:44', '2015-05-11 20:19:44')

  def destroy
    if @transaction.end_date.nil?
      @transaction.end_date = DateTime.now
      @transaction.save
      Book.find_by_id(@transaction.book_id).update_attribute :checked_out, false
---
UPDATE `transactions` SET `end_date` = '2015-05-12 01:34:02', `updated_at` = '2015-05-12 01:34:02' WHERE `transactions`.`id` = 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

    def set_transaction
    	@transaction = Transaction.find(params[:id])
---
SELECT  `transactions`.* FROM `transactions` WHERE `transactions`.`id` = 2 LIMIT 1

    def set_book
      Rails.logger.debug("SETTING BOOK CHECKING")
      @book = Book.find(params[:book_id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1